src/Catalogs/ЭД_Показатели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ЭД_Показатели</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ЭД_Модель</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КолонкаЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭД_Колонки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОбработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭД_СпособыОбработкиПоказателейОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеМасштабируется</Name>
					<Comment>Точность отображения показателя не зависит от точности отображения документа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Точность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭД_Строки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗначения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭД_ТипыЗначений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ЭД_Показатели/Ext/ObjectModule.bsl
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Префикс = СокрЛП(Владелец.Код) + "_П";
КонецПроцедуры


Процедура ПроверитьДублиПоСтрокеИКолонке(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЭД_Показатели.Ссылка КАК Ссылка,
		|	ЭД_Показатели.Код КАК Код
		|ИЗ
		|	Справочник.ЭД_Показатели КАК ЭД_Показатели
		|ГДЕ
		|	ЭД_Показатели.Ссылка <> &Ссылка
		|	И ЭД_Показатели.КолонкаЭД = &КолонкаЭД
		|	И ЭД_Показатели.СтрокаЭД = &СтрокаЭД";
	
	Запрос.УстановитьПараметр("Ссылка", 	Ссылка);
	Запрос.УстановитьПараметр("СтрокаЭД", 	СтрокаЭД);
	Запрос.УстановитьПараметр("КолонкаЭД", 	КолонкаЭД);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	СуществующиеПоказатели = "";
	
	Пока Выборка.Следующий() Цикл
		СуществующиеПоказатели = СуществующиеПоказатели + Выборка.Код + ", ";
	КонецЦикла;
	
	Если СуществующиеПоказатели <> "" Тогда
		Отказ = Истина;
		СуществующиеПоказатели = Лев(СуществующиеПоказатели, СтрДлина(СуществующиеПоказатели) - 2);
		Сообщить("Уже существуют показатели со строкой """ + СтрокаЭД +  """ и колонкой """ + КолонкаЭД + """ с кодами: " + СуществующиеПоказатели, СтатусСообщения.Важное); 
	КонецЕсли;	
	
КонецПроцедуры	


Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;    	
	
	ПроверитьДублиПоСтрокеИКолонке(Отказ);
	
	
КонецПроцедуры
